{"questions":[{"describe":"What type of field can be used to filter a Report Chart that has been added to a Page Layout?","answerOptions":[{"isRight":false,"describe":"Name Field"},{"isRight":false,"describe":"Formula Field"},{"isRight":true,"describe":"Matching ID Field"},{"isRight":false,"describe":"Standard field"}]},{"describe":"At Universal Containers, the VP of Service has requested a visual indicator flag on each case, based on the case priority. High-priority cases should be flagged red, medium-priority should be flagged yellow, and low-priority cases should be flagged green. Which formula would accomplish this requirement? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"CASE( Priority, “Low”, “img/samples/flag_green.gif”, “Medium”, “img/samples/flag_yellow.gif”, “High”, “img/samples/flag_red.gif”, “/s.gif”)"},{"isRight":true,"describe":"IMAGE( IF(ISPICKVAL(Priority, “Low”), “img/samples/flag_green.gif”, IF(ISPICKVAL(Priority, “Medium”), “img/samples/flag_yellow.gif”, IF(ISPICKVAL(Priority, “High”), “img/samples/flag_red.gif”))), “Priority Flag”)"},{"isRight":false,"describe":"IF(ISPICKVAL(Priority, “Low”), “img/samples/flag_green.gif”, IF(ISPICKVAL(Priority, “Medium”), “img/samples/flag_yellow.gif”, IF(ISPICKVAL(Priority, “High”), “img/samples/flag_red.gif”, “/s.gif”)))"},{"isRight":true,"describe":"IMAGE(CASE( Priority, “Low”, “img/samples/flag_green.gif”, “Medium”, “img/samples/flag_yellow.gif”, “High”, “img/samples/flag_red.gif”, “Priority Flag”)"}]},{"describe":"Universal Containers has a custom assessment object used by three divisions. Each division wants to track different information on the assessments, including different values for the status picklist. Division managers do not want their teams to be able to create another division’s assessment. How can this be accomplished?","answerOptions":[{"isRight":false,"describe":"Create additional custom assessment objects, one for each division, to track their assessments so information can be tracked separately. Use profiles to restrict access to the three custom objects."},{"isRight":true,"describe":"Create separate assessment record types for each division and use them to limit picklist values. Create separate page layouts for each record type and use profiles to restrict record type access."},{"isRight":false,"describe":"Create three page layouts to determine the fields and picklist values for each user based on the division indicated on their user record. Use field-level security to restrict access to each division’s fields."},{"isRight":false,"describe":"Create a separate page layout for each division and assign them profiles. Use the profile setting to configure each division’s custom field list and picklist values for assessments."}]},{"describe":"Which rule can be configured for the Opportunity object? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Escalation Rule"},{"isRight":true,"describe":"Workflow Rule"},{"isRight":true,"describe":"Validation Rule"},{"isRight":false,"describe":"Assignment Rule"}]},{"describe":"A customer service representative at a call center would like to be able to collect information from customers using a series of question prompts. What could be used to accomplish this?","answerOptions":[{"isRight":false,"describe":"Lightning process builder"},{"isRight":false,"describe":"Workflows rules"},{"isRight":false,"describe":"Lightning connect"},{"isRight":true,"describe":"Visual workflow"}]},{"describe":"Universal containers wants to provide a different view for its users when they access an Account record in Salesforce1 instead of the standard web version.How can this be accomplished? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"By adding a mobile layout and assigning it to a profile."},{"isRight":false,"describe":"By adding quick actions in the publisher section."},{"isRight":false,"describe":"By adding actions in the Salesforce1 action bar section."},{"isRight":true,"describe":"By adding Visualforce page to the mobile cards section."}]},{"describe":"A custom object named Assignment has a private sharing setting that grants access using hierarchies. The organization has a role hierarchy where the “Specialist” role reports to a “Manager” role which reports to a “Director” role. The director role is at the top of the role hierarchy. A user who is the manager role creates a new Assignment record. Who can send this record?","answerOptions":[{"isRight":true,"describe":"The record owner and the directors in their hierarchy."},{"isRight":false,"describe":"The record owner and those above the specialist role in their hierarchy."},{"isRight":false,"describe":"The record owner and the managers in their hierarchy."},{"isRight":false,"describe":"The record owner and the specialists in their hierarchy."}]},{"describe":"The App Builder at Universal Containers has been asked to ensure that the Amount field is populated when the stage is set to Closed Won. What can be used to meet this requirement?","answerOptions":[{"isRight":false,"describe":"Validation Rule"},{"isRight":false,"describe":"Lightning Process Builder"},{"isRight":true,"describe":"Workflow"},{"isRight":false,"describe":"Approval Process"}]},{"describe":"A junction object has two Master-Detail relationships. What happens to a junction object record when either associated master record is deleted?","answerOptions":[{"isRight":true,"describe":"The record is deleted and placed in the recycle bin."},{"isRight":false,"describe":"The master record can’t be deleted if it has a child record."},{"isRight":false,"describe":"The look-up field on the junction object record is cleared."},{"isRight":false,"describe":"The record is permanently deleted and can’t be restored."}]},{"describe":"Universal containers is importing 1000 records into Salesforce. They want to avoid any duplicate records from being created during the import. How can these requirements be met?","answerOptions":[{"isRight":false,"describe":"When importing the file, select the “Prevent Duplicates” option on the last step of the Import Wizard and import the file."},{"isRight":true,"describe":"Include a column in the import file that has either record names, Salesforce IDs, or external IDs that can be used to match records."},{"isRight":false,"describe":"After importing all of the custom objects, review all records created and manually merge or delete and duplicate record."},{"isRight":false,"describe":"After importing all of the custom objects, run a duplicate check report, export the record to a CSV File, and run a mas delete to purge any duplicates."}]},{"describe":"What is a feature that can extend record access beyond the organization-wide defaults? Choose 2 Answers","answerOptions":[{"isRight":false,"describe":"Public or private groups."},{"isRight":true,"describe":"Criteria-based sharing rules."},{"isRight":true,"describe":"Owner-based sharing rules."},{"isRight":false,"describe":"Dynamic role hierarchy."}]},{"describe":"Universal Containers uses a custom object to track open job positions. They would like to automatically post updates on a record’s feed whenever a position stage is changed. Which social feature can be used to accomplish this?","answerOptions":[{"isRight":false,"describe":"Workflow rule"},{"isRight":false,"describe":"Feed Quick Action"},{"isRight":false,"describe":"Auto-response rule"},{"isRight":true,"describe":"Feed tracking"}]}],"title":"New Salesforce AppBuilder Certification Questions – set4"}