{"questions":[{"describe":"When a user creates an Account report, the user does not see Industry as an available field in the report builder. However, this same user is able to see it in the Account page layout. What scenario would cause this?","answerOptions":[{"isRight":true,"describe":"The user uses a custom report type which does not include the Industry field."},{"isRight":false,"describe":"The Industry field has no record values in the Account."},{"isRight":false,"describe":"The Industry field is not enabled for the particular record type."},{"isRight":false,"describe":"The user does not have Industry field visibility in the field – level security."}]},{"describe":"What is a true statement in regards to managing access to reports and dashboards? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Users with the “Manage Public Reports” permission can organize reports by creating custom report folders and sending invitations to users to access them."},{"isRight":false,"describe":"Users must have certain permissions to access public, hidden, or shared folders."},{"isRight":true,"describe":"Users with the “Manage Public Reports” and “Create and Customize Reports” permissions can create custom reports that all users can view."},{"isRight":false,"describe":"Users that want to grant access to personal folders can manually share a personal folder with a user or public group."}]},{"describe":"Which setting is available to customize Salesforce1 mobile app for branding?Choose 3 answers","answerOptions":[{"isRight":true,"describe":"Header and search bar color."},{"isRight":true,"describe":"The image on loading page."},{"isRight":true,"describe":"Background color on loading page."},{"isRight":false,"describe":"Notification and search icon."},{"isRight":false,"describe":"Action bar color."}]},{"describe":"The CRM Manager at Universal Containers has requested that a custom text field be converted to a picklist in order to promote better data hygiene. What needs to be considered before changing the field type? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Existing list views that reference the field may be deleted."},{"isRight":false,"describe":"Field references will be removed in Visualforce pages."},{"isRight":true,"describe":"All data should be backed up before converting a text field."},{"isRight":false,"describe":"Changing a field type will remove existing field history."}]},{"describe":"At Universal Containers, multiple departments utilize the Case object for different purposes. Some users submit cases for IT and HR requests. Other users provide customer support with case records. How can an App Builder enable different users to see different fields based on the case type?","answerOptions":[{"isRight":false,"describe":"Create different case field sets for IT, HR, and Customer Support. Assign different field sets by profile."},{"isRight":false,"describe":"Create different case record types for IT, HR, and Customer Support. Assign different page layouts to each record type by role."},{"isRight":true,"describe":"Create different case record types for IT, HR, and Customer Support. Assign different page layouts to each record type by profile."},{"isRight":false,"describe":"Create different case field sets for IT, HR, and Customer Support. Assign different field sets by role."}]},{"describe":"Universal Containers has deployed custom tabs through change sets, without including the profiles, to Production (Enterprise Edition). Which statement is true in regards to the visibility of custom tabs?","answerOptions":[{"isRight":false,"describe":"Custom tabs are default on for all users."},{"isRight":false,"describe":"Custom tabs are default off for all users."},{"isRight":false,"describe":"Custom tabs are exposed for all users."},{"isRight":true,"describe":"Custom tabs are hidden for all users."}]},{"describe":"Which values must be defined when creating a new Opportunity Stage?Choose 3 answers","answerOptions":[{"isRight":false,"describe":"Close Date"},{"isRight":false,"describe":"Amount"},{"isRight":true,"describe":"Probability"},{"isRight":true,"describe":"Forecast Category"},{"isRight":true,"describe":"Type"}]},{"describe":"What may occur if workflow rules are reevaluated after a field change by a field update? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Cross-object workflow rules result in re-evaluation after field change."},{"isRight":false,"describe":"Workflow rules trigger validation rules on field updates."},{"isRight":true,"describe":"Workflow rules trigger more workflow rules to be re-evaluated."},{"isRight":true,"describe":"A recursive loop potentially results in exceeding organizational limits."}]},{"describe":"The VP of sales at Universal Containers wants to have a set of screens to guide the inside sales team through collecting and updating data for leads. How can the App Builder accomplish this?","answerOptions":[{"isRight":true,"describe":"Visual Workflow"},{"isRight":false,"describe":"Lightning Process Builder"},{"isRight":false,"describe":"Workflow"},{"isRight":false,"describe":"Lightning Connect"}]},{"describe":"A divisional manager wants to add a chart into a page layout Which report format can be used as the source report to accomplish this? Choose 2 answers.","answerOptions":[{"isRight":true,"describe":"Matrix format with a chart."},{"isRight":false,"describe":"Joined format with a chart."},{"isRight":false,"describe":"Tabular format with a chart."},{"isRight":true,"describe":"Summary format with a chart."}]},{"describe":"What is a use case for approval processes? Choose 2 answers.","answerOptions":[{"isRight":true,"describe":"Approve expense reports automatically when less than $50."},{"isRight":false,"describe":"Update the PTO record field with the user’s manager."},{"isRight":true,"describe":"Require the CFO to review the salary range for all job offers."},{"isRight":false,"describe":"Ensure an opportunity that has at least one product added."}]},{"describe":"Which statement is true about an External ID field? Choose 2 answers.","answerOptions":[{"isRight":true,"describe":"The field must be unique since duplicates are not allowed within Salesforce."},{"isRight":true,"describe":"The field contains unique record identifiers from a system outside of Salesforce."},{"isRight":false,"describe":"The field can be unique based on case-sensitive or case-insensitive values."},{"isRight":false,"describe":"The field must contain at least one number and at least one letter."}]}],"title":"New Salesforce AppBuilder Certification Questions -set3"}