{"questions":[{"describe":"The VP of Marketing wants to broadcast an email to 10,000 contacts in Salesforce on a regular basis, but realizes Salesforce’s mass email functionality has a limitation on the number of emails that can be sent each day.","answerOptions":[{"isRight":false,"describe":"Develop Apex code and Visualforce pages to send the emails."},{"isRight":false,"describe":"Download all contacts to a CSV file and use an email client to send the mails."},{"isRight":true,"describe":"Research and evaluate products available on AppExchange to send mass emails."},{"isRight":false,"describe":"Request Salesforce increase the number of maximum daily mails."}]},{"describe":"The customer service team at Universal containers uses a custom Project object to track their customer projects. An App builder needs to create a relationship between the project object and the related client Account record. A private sharing model is in place for both Accounts and projects. Which statement is true when creating an Account lookup field on the Project object? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"The account lookup field on the project record can be made optional."},{"isRight":true,"describe":"Cross-object field updates between the Project and Account records are not supported."},{"isRight":false,"describe":"Users can only delete Accounts if they have access to related projects records."},{"isRight":false,"describe":"The account record can include roll-up summary field with data from the project records"}]},{"describe":"Sales representatives want to capture custom Feedback record details related to each Account. The sales reps want to accomplish this with minimal clicks on the Salesforce1 mobile application. What is the recommended solution to meet this requirement? Choose 2 answers.","answerOptions":[{"isRight":true,"describe":"Create predefined values for most of the fields."},{"isRight":false,"describe":"Create a global action on Account."},{"isRight":false,"describe":"Create a feedback object as a parent of Account."},{"isRight":true,"describe":"Create an object-specific action on Account."}]},{"describe":"Which statement is true when defining a Create custom action for the Contact object? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"The create action will ignore field requirements."},{"isRight":true,"describe":"The create action can pre-define Contact field values."},{"isRight":true,"describe":"The create action allows a user to select a record type."},{"isRight":false,"describe":"The create action will respect validation rules."}]},{"describe":"What may occur if workflow rules are reevaluated after a field change by a field update?","answerOptions":[{"isRight":true,"describe":"A recursive loop potentially results in exceeding organizational limits."},{"isRight":false,"describe":"Cross-object workflow rules result in re-evaluation after field change."},{"isRight":false,"describe":"Workflow rules trigger validation rules on field updates."},{"isRight":true,"describe":"Workflow rules trigger more workflow rules to be re-evaluated."}]},{"describe":"Universal Containers conduct evaluations of their sales reps using a custom object consisting of numerical scores and executive comments. The company wants to ensure that only the sales reps, and their manager’s executive can view the rep’s evaluation record but the reps should not be able to view the executive comment field on their review. How can these requirement be met?","answerOptions":[{"isRight":false,"describe":"Use a private sharing model granting record access using hierarchy; manage field access with record types and field-level security."},{"isRight":false,"describe":"Use a private sharing model granting record access using custom setting; manage field access with page layouts and field level security."},{"isRight":true,"describe":"Use a private sharing model granting record access using hierarchy; manage field access with field-level security."},{"isRight":false,"describe":"Use a private sharing model granting record access using custom setting; manage field access with record types and page layouts."}]},{"describe":"Universal containers would like to use a chatter group for their mergers and acquisition team to collaborate on potential new projects. This group should not be visible for non-members to see or join, and can be accessed by invite only.Which chatter Group type should the App Builder recommend?","answerOptions":[{"isRight":false,"describe":"Member Group"},{"isRight":true,"describe":"Unlisted Group"},{"isRight":false,"describe":"Public Group"},{"isRight":false,"describe":"Private Group"}]},{"describe":"Which capability allows an app builder to grant object-level access? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Assigning a user a Profile that allows Read access to an object."},{"isRight":false,"describe":"Assigning a user a Public Group that allows for Read and Edit access to an object."},{"isRight":true,"describe":"Assigning a user a Permission Set that allows Read and Edit access to an object."},{"isRight":false,"describe":"Assigning a user a Role that allows Read access to an object."}]},{"describe":"When configuring a record type, an App Builder can configure the available value of a picklist field for the page layout. Which opportunity standard field is available to be configured directly in the Opportunity record type? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Forecast Category"},{"isRight":true,"describe":"Lead Source"},{"isRight":true,"describe":"Type"},{"isRight":false,"describe":"Stage"}]},{"describe":"Universal Containers has created the custom objects Candidate and Interview in Salesforce to track candidates and interviews respectively. The company wants to track the total number of interviews a candidate has gone through on the candidate record without writing any code. How can app builder accomplish this requirements? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Use a roll-up summary field on the candidate record to show the total number of interviews."},{"isRight":true,"describe":"Use a master-detail relationship between the Candidate and the Interview objects."},{"isRight":false,"describe":"Use a lookup relationship between the Candidate and Interview objects."},{"isRight":false,"describe":"Use a formula field on the candidate record to show the total number of interviews."}]},{"describe":"What type of field can be referenced by a Roll-up Summary field using SUM?Choose 3 answers.","answerOptions":[{"isRight":false,"describe":"Formula"},{"isRight":true,"describe":"Currency"},{"isRight":true,"describe":"Number"},{"isRight":true,"describe":"Percent"},{"isRight":false,"describe":"Date"}]},{"describe":"Universal Containers provides access to Salesforce for their sales, service and marketing teams. Management wants to ensure that when users log in, their home tab provides access to links and documentation that are specifically relevant to their job function. How can this requirement be met?","answerOptions":[{"isRight":false,"describe":"Create separate home page custom components and layouts; assign to users by role."},{"isRight":true,"describe":"Create separate home page custom components and layouts; assign to users by profile."},{"isRight":false,"describe":"Expose specific elements within a home page custom component determined by role."},{"isRight":false,"describe":"Expose specific elements within a home page custom components determined by profile."}]}],"title":"New Salesforce AppBuilder CertificationQuestions – set 10"}