{"questions":[{"describe":"Universal Containers would like to collaborate with its customers within Salesforce, and has decided to enable the “Allow Customer Invitations” Chatter setting. What permission is granted to Customers when invited to Chatter Group?","answerOptions":[{"isRight":false,"describe":"The ability to invite members to groups of which they are a member."},{"isRight":false,"describe":"The ability to @mention accounts of which they are a contact."},{"isRight":false,"describe":"The ability to request access to public groups."},{"isRight":true,"describe":"The ability to interact with members of their groups."}]},{"describe":"Which statement is true when a new full sandbox is created? Choose 2 ans","answerOptions":[{"isRight":false,"describe":"User’s email addresses will not be modified."},{"isRight":true,"describe":"Default email deliverability is set to system email only."},{"isRight":false,"describe":"Chatter data will be copied to the sandbox by default."},{"isRight":true,"describe":"Usernames will be modified uniquely for that sandbox."}]},{"describe":"Universal Containers has purchased a Lightning Component on the AppExchange. Where can that component be utilized. Choose 2 ans","answerOptions":[{"isRight":false,"describe":"Visual Workflow"},{"isRight":true,"describe":"Salesforce1 Mobile App"},{"isRight":false,"describe":"Lightning Process Builder"},{"isRight":true,"describe":"Standalone Lightning App"}]},{"describe":"Which is statement is true for embedding a Visualforce page in a page layout?Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Visualforce pages on page layout have attributes for width and height."},{"isRight":true,"describe":"Visualforce pages can be placed anywhere in a page layout."},{"isRight":false,"describe":"Visualforce pages can only be placed in a Visualforce section in a page layout."},{"isRight":false,"describe":"Visualforce pages on a field set have attributes for width and height."}]},{"describe":"Universal Containers needs a field on the Account to track how many Opportunities are closing within the next 30 days. What can be used to accomplish this goal?","answerOptions":[{"isRight":false,"describe":"Process Builder"},{"isRight":true,"describe":"Apex Code"},{"isRight":false,"describe":"Roll-up summary field"},{"isRight":false,"describe":"Workflow Rule"}]},{"describe":"Universal Containers has two teams: Sales and Services. Both teams interact with the same records. Sales users use ten fields on the Account record. Services users use three of the same fields as the Sales team, but also have five of their own, which the sales team does not use. What is the minimum configuration necessary to meet this requirement?","answerOptions":[{"isRight":false,"describe":"One profile, two record types, one page layout."},{"isRight":true,"describe":"Two profiles, two record types, two page layouts."},{"isRight":false,"describe":"One profile, one record type, one page layout."},{"isRight":false,"describe":"Two profiles, one record type, two page layouts."}]},{"describe":"The Director of Customer Service wants to know when agents are overwhelmed with high-priority items in the support queue. The Director wants to receive a notification when a new case is open with the status of “New” for more than four business hours. Which automation process could be used to accomplish this?Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Escalation rules"},{"isRight":false,"describe":"Visual workflow"},{"isRight":true,"describe":"Lightning Process Builder"},{"isRight":false,"describe":"Scheduled Apex"}]},{"describe":"Representatives at Universal Containers use Salesforce to record information for leads. When new prospects are added, an outbound message is sent to SAP with lead’s information. Which automation process will accomplish this without writing any code?","answerOptions":[{"isRight":false,"describe":"Create a process using Lightning Process Builder to send the outbound message."},{"isRight":true,"describe":"Create a Workflow Rule with an outbound message as the action."},{"isRight":false,"describe":"Use Visual Workflow to create a wizard that will send an outbound message."},{"isRight":false,"describe":"Design an Approval Process that sends an outbound message upon arrival."}]},{"describe":"A customer service representative at a call center would like to be able to collect information from customers using a series of question prompts. What could be used to accomplish this?","answerOptions":[{"isRight":false,"describe":"Workflow Rules"},{"isRight":true,"describe":"Visual Workflow"},{"isRight":false,"describe":"Lightning Connect"},{"isRight":false,"describe":"Lightning Process Builder"}]},{"describe":"Which use case can be accomplished using a custom link?Choose 3 answers","answerOptions":[{"isRight":false,"describe":"Navigate to a process to update the current record."},{"isRight":true,"describe":"Navigate to a custom Visual Flow to update the current record."},{"isRight":true,"describe":"Navigate to an external system using data in Salesforce."},{"isRight":false,"describe":"Navigate to an Apex Trigger to update the current record."},{"isRight":true,"describe":"Navigate to a create a record page with fields pre-populated."}]},{"describe":"Universal Containers would like to embed a chart of all related Opportunities, by stage, on the Account detail page. Which type of report should the App Builder create to add to the Account page layout?","answerOptions":[{"isRight":true,"describe":"A summary report on the Opportunity object."},{"isRight":false,"describe":"A summary report on the Account object."},{"isRight":false,"describe":"A tabular report on the Account object."},{"isRight":false,"describe":"A tabular report on the Opportunity object."}]},{"describe":"The VP of Sales at Universal Containers has requested that Sales reps be given access to view all Accounts in Salesforce. However, they’ve also requested that sales reps only be allowed to create new Opportunities on Accounts they own.How can this requirement be met?","answerOptions":[{"isRight":false,"describe":"Create an Opportunity Validation Rule that compares the Opportunity and Account Owners."},{"isRight":false,"describe":"Create a new Opportunity Quick Action that validates Account ownership."},{"isRight":false,"describe":"Set the Organization-Wide Defaults sharing on Opportunities to Private and recalculate sharing."},{"isRight":true,"describe":"Set the Organization-Wide Defaults sharing on Opportunities to Controlled by Parent."}]}],"title":"New SalesforceAppBuilderCertification – Questions set6"}