{"questions":[{"describe":"User at Universal Containers need to be able to quickly create a contact record from the Account record’s Chatter feed. How should the App Builder enable the functionality?","answerOptions":[{"isRight":true,"describe":"By creating a custom “Create a Record” Action on the Account."},{"isRight":false,"describe":"By creating a custom “Detail Page” Button on the Account."},{"isRight":false,"describe":"By creating a custom “Detail Page” Button on the Contract."},{"isRight":false,"describe":"By creating a custom “Create a Record” Action on the Contract."}]},{"describe":"A Customer Support Manager at Universal Containers would like to implement call scripting for their caller agents. What automation tool can be used to accomplish this?","answerOptions":[{"isRight":false,"describe":"Workflow"},{"isRight":false,"describe":"Lightning process Builder"},{"isRight":true,"describe":"Visual Workflow"},{"isRight":false,"describe":"Lightning Connect"}]},{"describe":"An App Builder is loading the data into salesforce. To link the new records back to the legacy system, a field will be used to track the legacy ID on the account object. For future data loads this ID will be used when upserting records.Which field attribute should be selected? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Unique"},{"isRight":false,"describe":"Required"},{"isRight":true,"describe":"External ID"},{"isRight":false,"describe":"Text(encrypted)"}]},{"describe":"Universal Containers is rolling out a new customer service process. Customer service managers will need to edit cases for their subordinates, but not cases for other groups. Managers and users should be able to view all cases. What is the recommended solution to configure this? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Create standard role hierarchies."},{"isRight":true,"describe":"Set organization-wide sharing defaults to public read/only."},{"isRight":false,"describe":"Create criteria-based sharing rules."},{"isRight":false,"describe":"Set organization-wide sharing defaults to private."}]},{"describe":"An app builder would like to streamline the user experience by reflecting summarized calculations of specific fields on various objects. Which field types could be used in roll-up summary fields to accomplish this? Choose 3 answers","answerOptions":[{"isRight":true,"describe":"Currency"},{"isRight":true,"describe":"Percent"},{"isRight":true,"describe":"Date"},{"isRight":false,"describe":"Checkbox"},{"isRight":false,"describe":"Time"}]},{"describe":"Universal Containers stores invoices in SAP. Users want to view invoice data on the related Account records in Salesforce. How can this be achieved? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Create a custom Invoice object and connect to SAP using Data Loader."},{"isRight":true,"describe":"Create an external object connected to an invoice table in SAP."},{"isRight":false,"describe":"Use SAP data export functions to load data directly in Salesforce."},{"isRight":true,"describe":"Connect to an OData Publisher Service for SAP databases."}]},{"describe":"What should be done to provide managers access to records of which they are not the owner in a private sharing model?","answerOptions":[{"isRight":true,"describe":"Create a Manager permission set and select the “View All Data” option."},{"isRight":false,"describe":"Create a Manager profile and select the “View My Teams Data” option."},{"isRight":false,"describe":"Define a Role Hierarchy and use the Grant Access Using Hierarchies option."},{"isRight":false,"describe":"Set the Manger field for each User Record on the Manager’s team."}]},{"describe":"What is a true statement regarding roll-up summary fields? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Roll-up summary fields can only be created on the master of a master-detail relationship."},{"isRight":true,"describe":"The roll-up summary field inherits the field – level security of the child object."},{"isRight":false,"describe":"Changes to the value of a roll-up summary field column of roll-up summary filters."},{"isRight":false,"describe":"Multi-select picklist fields can be used in the field column of roll-up summary filters."}]},{"describe":"A custom field on an account is used to track finance information about a customer. Only members of the Finance Team have access to this field. However, the business wants to allow one customer service agent, who is assigned the customer service profile, read-only access to this field for special circumstances.What is the recommended solution to grant the customer service agent access to the field?","answerOptions":[{"isRight":true,"describe":"Create a permission set that allows read-only access to the field via Field Level Security and assign it to the agent."},{"isRight":false,"describe":"Create a new profile to allow for read-only access to the field via Field Level Security and assign it to the agent."},{"isRight":false,"describe":"Update the Customer Service Profile already assigned to the agent to allow for read-only access to the field via Field Level Security."},{"isRight":false,"describe":"Update the custom field’s Field Level Security in setup to allow the agent read-only access to the field."}]},{"describe":"An app Builder creates an Account validation rule on the Industry field that will throw an error if the length of the field is longer than 6 characters. Another App Builder creates a workflow rule with a field update that sets the Industry field to Technology whenever the Billing City field is set to San Francisco. What will happen the next time a sales person saves an Account with a Billing City of San Francisco?","answerOptions":[{"isRight":true,"describe":"The record will save and the Industry field will change to Technology."},{"isRight":false,"describe":"The record will not save and the validation rule’s error message will be displayed."},{"isRight":false,"describe":"The record will not save and no error message will be displayed."},{"isRight":false,"describe":"The record will save but the Industry field will not change to Technology."}]},{"describe":"Universal Containers uses a custom object to track Site Visits. When the status of a Site Visit is changed from “In Progress” to “On Hold”, the business wants the Site visit owner to be automatically assigned to an “On Hold” queue. Which capability can be used to accomplish this?","answerOptions":[{"isRight":true,"describe":"Apex Trigger"},{"isRight":false,"describe":"Action"},{"isRight":false,"describe":"Assignment Rule"},{"isRight":false,"describe":"Visual Workflow"}]},{"describe":"When should Unmanaged packages be created? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Deploying from a Developer Edition environment."},{"isRight":false,"describe":"Publishing an application for sale on the AppExchange."},{"isRight":false,"describe":"Migrating of components from sandbox to production."},{"isRight":true,"describe":"Distributing open-source projects on AppExchange."}]}],"title":"New Salesforce AppBuilder Certification – Questions set2"}