{"questions":[{"describe":"Which statement is true about converting a lead? Choose 3 answers","answerOptions":[{"isRight":true,"describe":"The lead’s most recent campaign record is automatically applied to the “PRIMARY campaign source” field on the opportunity."},{"isRight":false,"describe":"Users can convert leads that are associated with an active approval process."},{"isRight":false,"describe":"Multi-select picklist values on lead records overwrite values on the contact’s corresponding field."},{"isRight":true,"describe":"Administrators may choose whether to enforce validation rules & triggers."},{"isRight":true,"describe":"The system automatically maps standard lead fields to standard account, contact, and opportunity fields."}]},{"describe":"Which statement is true about an external id field? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"The field must be unique since duplicates are not allowed within salesforce."},{"isRight":false,"describe":"The field can be unique based on case-sensitive or case-insensitive values."},{"isRight":false,"describe":"The field must contain at least one number and at least one letter."},{"isRight":true,"describe":"The field contains unique records identifiers from a system outside of salesforce."}]},{"describe":"Which objects can be members of a campaign? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"contact"},{"isRight":false,"describe":"account"},{"isRight":false,"describe":"opportunity"},{"isRight":true,"describe":"lead"}]},{"describe":"Universal containers needs to flag leads with one or more business areas. They need to add a field to capture these to the lead records. There is no need to report on this field. What is the appropriate field type?","answerOptions":[{"isRight":false,"describe":"Radio Buttons( multi select)"},{"isRight":false,"describe":"Picklist"},{"isRight":false,"describe":"Text area"},{"isRight":true,"describe":"Picklist (multi-select)"}]},{"describe":"Universal Containers is setting up salesforce for the first time. management wants the sales and marketing teams to have different navigation names in the salesforce1 mobile app. Which option is available to an app builder to satisfy the requirement?","answerOptions":[{"isRight":true,"describe":"Create sales and marketing profiles to ensure read access to different objects."},{"isRight":false,"describe":"Create roles for sales and marketing and assign a custom homepage layout for each role."},{"isRight":false,"describe":"Create mobile navigation menus for both the sales and marketing profiles."},{"isRight":false,"describe":"Create public groups for sales and marketing and create mobile navigation menus for each group."}]},{"describe":"An app builder wants to show groups as the last navigation menu item in the salesforce1 mobile app. however, the app builder is not able to select groups as one of the items on the drop-down menu. What could cause this?","answerOptions":[{"isRight":false,"describe":"Groups is showing up in the recent section and not in the navigation menu."},{"isRight":false,"describe":"Groups is not included in the selected list for the navigation menu."},{"isRight":true,"describe":"Groups is included in the smart search items but not on the navigation menu."},{"isRight":false,"describe":"Groups can not be the last item in the navigation menu."}]},{"describe":"What is the true statement in regards to converting a tabular, summary, or matrix report to a joined report? Choose 3 answers","answerOptions":[{"isRight":false,"describe":"Joined report blocks are formatted as matrix reports."},{"isRight":true,"describe":"Bucket fields are not supported in joined reports."},{"isRight":true,"describe":"Cross filters are not supported in joined reports"},{"isRight":true,"describe":"The rows to display filter is not supported in Joinded reports."},{"isRight":false,"describe":"Report formula fields are nor supported in Joined reports."}]},{"describe":"When an opportunity close date is delayed by more than 60 days, the manager and the VP sales must approve the change. How can this requirement be met?Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Build an approval process that requires unanminous approval from the manager and VP of sales."},{"isRight":false,"describe":"Create a workflow rule that checks for close date less that 60 days and add an email alert."},{"isRight":true,"describe":"Create a lightning process builder flow that submits the record for an approval process."},{"isRight":false,"describe":"Build a validation rule that does not allow a user to save the opportunity record."}]},{"describe":"What is recommended to refresh a full sandbox?","answerOptions":[{"isRight":false,"describe":"After UAT sign-off."},{"isRight":false,"describe":"Whenever a new production used is added."},{"isRight":true,"describe":"After a major production release."},{"isRight":false,"describe":"Within 3 hours of when it is needed."}]},{"describe":"At Universal Containers, the Account object has a Master-Detail relationship with an Invoice custom object. The App Builder would like to change to a lookup field, but is not able to do so. What could be causing this?","answerOptions":[{"isRight":false,"describe":"The invoice must have at least one Master-Detail field for reporting."},{"isRight":true,"describe":"The Account record includes Invoice roll-up summary fields."},{"isRight":false,"describe":"The Invoice records have existing values in the Account."},{"isRight":false,"describe":"The Account is included in the workflow on the Invoice object."}]},{"describe":"Universal Containers would like to automatically assign a specific permission set to new users. How can this requirement be met? Choose 2 Answers","answerOptions":[{"isRight":false,"describe":"Create an approval process on the User object to assign a permission set."},{"isRight":true,"describe":"Create a flow on the user object to assign a permission set."},{"isRight":true,"describe":"Create a lightning process on the user object to launch a flow."},{"isRight":false,"describe":"Create a workflow rule on the User object to assign a permission set."}]},{"describe":"Which statement is true about field update actions from workflow rules and approval processes? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Field update with “re-evaluate workflow rules” selected can cause a recursive loop if the updated field is included in a workflow."},{"isRight":false,"describe":"Field update are not available on currency field if the organization uses multi-currency."},{"isRight":true,"describe":"Field updates to records based on workflow rules and approval processes do not trigger validation rules."},{"isRight":false,"describe":"Field updates are tracked in the history related list of a record regardless of whether or not"}]}],"title":"New Salesforce App Builder Certification – Questions – set 9"}