{"questions":[{"describe":"Universal Containers needs the ability to generate contract documents. All the data required for a contract resides in a custom object. What is the recommended solutions?","answerOptions":[{"isRight":false,"describe":"Enable the contract feature and create a custom Contract template based on the Standard template."},{"isRight":false,"describe":"Store a template in the static resources and configure the Action Link Template to use it."},{"isRight":false,"describe":"Create the HTML template for contracts and store it in the Public Folder."},{"isRight":true,"describe":"Select and install an AppExchange product to meet the contract generation needs."}]},{"describe":"What option is available to an App Builder when defining an object-specific Create Record custom action? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Pre-Defining field values on the target object."},{"isRight":false,"describe":"Redirecting the end user to the detail page of the target object."},{"isRight":true,"describe":"Specifying the fields and layout of the action."},{"isRight":false,"describe":"Allowing the end user to choose the record type."}]},{"describe":"To Synchronize Accounts, orders and shipments in real time, a developer has built a custom interface between an external system and salesforce, prior to deployment, the developer needs to confirm that the interface can sustain the syncing of thousands of records at a time. Which sandbox environment is recommended to complete performance and load testing?","answerOptions":[{"isRight":false,"describe":"Partial Sandbox"},{"isRight":false,"describe":"Developer Sandbox"},{"isRight":false,"describe":"Developer Pro Sandbox"},{"isRight":true,"describe":"Full Sandbox"}]},{"describe":"Universal Container needs to add an additional recipient to a workflow email alert that is fired from the case object. What type of field could be added to the case object to allow the additional desired recipient on the email alert? Choose 2 Answers","answerOptions":[{"isRight":false,"describe":"Formula field"},{"isRight":true,"describe":"Email field"},{"isRight":true,"describe":"Text field"},{"isRight":false,"describe":"Lookup field"}]},{"describe":"The Customer service team at universal Containers uses a custom project object to track their customer projects. An app builder needs to create a relationship between a project object and related client account record. A private sharing model is in place for both accounts and projects. Which statement is true when creating an account lookup field on the project object? Choose 2 Answers","answerOptions":[{"isRight":true,"describe":"Cross-object fields update between the project and account records are not supported."},{"isRight":true,"describe":"The account lookup field on the project record can be made optional"},{"isRight":false,"describe":"User can only delete accounts if they have access to related project records."},{"isRight":false,"describe":"The account record can include roll-up summary field with data from the project records."}]},{"describe":"An app builder has created a report for sales people to view records from the custom object, some users have complained that they are unable to see all of the appropriate records. What steps should be taken to ensure data visibility within the report? Choose 3 Answers","answerOptions":[{"isRight":true,"describe":"Check organization-wide defaults"},{"isRight":true,"describe":"Check the user’s profile for object settings."},{"isRight":false,"describe":"Check the report folder sharing settings."},{"isRight":false,"describe":"Check reports filter"},{"isRight":true,"describe":"Check Sharing rules."}]},{"describe":"Universal container has a custom object for shipping information. They have to ship to both businesses and consumers. They need to show additional values in the custom field called insurance type for business shipping records. How can this be set up?","answerOptions":[{"isRight":false,"describe":"Use Record type with single page layout."},{"isRight":false,"describe":"Create multiple picklist fields on the object."},{"isRight":false,"describe":"Use record types with multiple page layout."},{"isRight":true,"describe":"Create a multi-select pick-list field."}]},{"describe":"Universal container would like to use a chatter group for their mergers and Acquisitions to collaborate on potential new projects. The group should not be visible to non-members to see you or join, and can be accessed by invite only.Which chatter group type should the app builder recommend?","answerOptions":[{"isRight":true,"describe":"Unlisted Group"},{"isRight":false,"describe":"Public Group"},{"isRight":false,"describe":"Private Group"},{"isRight":false,"describe":"Member group"}]},{"describe":"Which statement is true for embedding a Visualforce page in a page Layout.Choose 2 Answers","answerOptions":[{"isRight":false,"describe":"Visualforce Pages on a field set have attributes for width and height."},{"isRight":true,"describe":"Visualforce Pages can be placed anywhere in the page layout."},{"isRight":true,"describe":"Visualforce Pages on a page layout have attributes for width and height."},{"isRight":false,"describe":"Visualforce Pages can only be place in the Visualforce section in a page layout."}]},{"describe":"What is the capability of schema Builder?  Choose 2 Answers","answerOptions":[{"isRight":true,"describe":"Showing selected objects on the page."},{"isRight":false,"describe":"Editing custom settings."},{"isRight":true,"describe":"Viewing page layout in a new window."},{"isRight":false,"describe":"Creating a new record type."}]},{"describe":"What is a section of the Lightning App Builder Tool? Choose 3 Answers","answerOptions":[{"isRight":true,"describe":"Canvas"},{"isRight":false,"describe":"Mini Page Layout"},{"isRight":true,"describe":"Selected Publisher actions"},{"isRight":false,"describe":"Mobile Cards"},{"isRight":true,"describe":"Components"}]},{"describe":"Universal Container wants to display a message when a case needs follow up.What can be used to display different text on the case record depending on the number of days a case is opened?","answerOptions":[{"isRight":true,"describe":"Formula Field"},{"isRight":false,"describe":"Workflow update"},{"isRight":false,"describe":"Case Process"},{"isRight":false,"describe":"Lightning Process Builder"}]}],"title":"New AppBuilder Certification Questions – set5"}