{"questions":[{"describe":"A manager wants to calculate the number of days since an account was last contacted through email. Which field type should be used to accomplish this?","answerOptions":[{"isRight":true,"describe":"Formula"},{"isRight":false,"describe":"Number"},{"isRight":false,"describe":"Roll-up Summary"},{"isRight":false,"describe":"Date"}]},{"describe":"Which capability allows an app builder to grant object-level access?Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Assigning a user a Profile that allows Read access to an object."},{"isRight":true,"describe":"Assigning a user a Permission Set that allows for Read and Edit access to an object."},{"isRight":false,"describe":"Assigning a user a Role that allows Read access to an object."},{"isRight":false,"describe":"Assigning a user a Public Group that allows for Read and Edit access to an object."}]},{"describe":"Universal Containers wants to standardize their business logic. They want to ensure that the workflow order is guaranteed to be the same each time.Which feature can be used to accomplish this? Choose 2 answers","answerOptions":[{"isRight":true,"describe":"Lightning Process Builder"},{"isRight":false,"describe":"Workflow"},{"isRight":false,"describe":"Chatter Actions"},{"isRight":true,"describe":"Visual Workflow"}]},{"describe":"Universal Containers has a junction object called Invoices with a primary Master-Detail relationship with Accounts and a secondary Master-Detail relationship with Contacts. The app builder has a requirement to change the primary Master-Detail relationship to Lookup. What happens to the Master-Detail relationship with Contacts?","answerOptions":[{"isRight":false,"describe":"The Contacts Master-Detail values are cleared from invoices."},{"isRight":false,"describe":"The Contacts Master-Detail also converts to Lookup."},{"isRight":false,"describe":"The Contacts Master-Detail field is deleted from the object."},{"isRight":true,"describe":"The Contacts Master-Detail becomes the primary."}]},{"describe":"Where can a custom button be placed? Choose 3 answers","answerOptions":[{"isRight":false,"describe":"On the User Object"},{"isRight":true,"describe":"On the Custom List View"},{"isRight":true,"describe":"On a Person Account"},{"isRight":true,"describe":"On a related list"},{"isRight":false,"describe":"On a Web-to-Case form"}]},{"describe":"Universal Containers has separated business requirements for consumer and Business Opportunities. The sales team work with both types of Opportunities. The app builder created two record types on the Opportunity Object.Which action can now be performed? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Prevent access to secure data fields by sales process."},{"isRight":true,"describe":"Specify a different page layout by sales process."},{"isRight":true,"describe":"Enable field validation by sales process."},{"isRight":false,"describe":"Create unique Opportunity stages by sales process."}]},{"describe":"Universal Containers provide access to Salesforce for their sales, service and marketing teams. Management wants to ensure that when user login, their home tab provides access to links and documentation that are specifically relevant to their job function. How can this requirement be met?","answerOptions":[{"isRight":false,"describe":"Create separate home page custom components and layouts; assign to user by role."},{"isRight":false,"describe":"Expose specific elements within a home page custom component determined by profile."},{"isRight":true,"describe":"Create separate home page custom components and layouts; assign to user by profile."},{"isRight":false,"describe":"Expose specific elements within a home page custom component determined by role."}]},{"describe":"What metadata changes can be made directly in a production environment without deploying from sandbox? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Apex triggers"},{"isRight":true,"describe":"Visualforce pages"},{"isRight":true,"describe":"Validation rules"},{"isRight":false,"describe":"Apex classes"}]},{"describe":"What is the capability of sandbox templates? Choose 2 answers","answerOptions":[{"isRight":false,"describe":"Create a Partial Copy sandbox from a Partial Copy sandboxes environment."},{"isRight":true,"describe":"Specify the object whose data should be replicated in a Partial Copy sandbox environment."},{"isRight":false,"describe":"Specify the data range for data being replicated in a Partial Copy sandbox environment."},{"isRight":true,"describe":"Save a template for re-use when creating a Partial Copy sandbox environment."}]},{"describe":"Universal Containers would like to show different picklist values to different groups of user in a custom picklist field. What should be configured?","answerOptions":[{"isRight":false,"describe":"Permission sets"},{"isRight":false,"describe":"Field-level security"},{"isRight":true,"describe":"Record types"},{"isRight":false,"describe":"Page layouts"}]},{"describe":"What salesforce functionality is ignored when processing field updates in workflow rules and approval processes? Choose 3 answers.","answerOptions":[{"isRight":true,"describe":"Validation rules"},{"isRight":false,"describe":"Decimal places and character limits"},{"isRight":true,"describe":"Record type picklist value assignments"},{"isRight":false,"describe":"Multiple currencies"},{"isRight":true,"describe":"Field-level security"}]},{"describe":"In order to delete the Opportunities, Universal Containers would like sales reps to submit requests for approval from their sales manager. What can be used to meet these requirements?","answerOptions":[{"isRight":false,"describe":"Approval Process with Time-Dependent workflow action."},{"isRight":false,"describe":"Approval Process with Apex Trigger."},{"isRight":false,"describe":"Two-step Approval process."},{"isRight":true,"describe":"Process Builder with Submit for Approval action."}]}],"title":"New Salesforce AppBuilder Certification – Questions set1"}