{"questions":[{"describe":"At Universal Containers, multiple departments utilize the Case object for different purposes. Some users submit cases for IT and HR requests. Other users provide customer support 999with case records. How can an App Builder enable different users to see different fields, based on the case type?","answerOptions":[{"isRight":true,"describe":"Create different case record types for IT, HR and Customer Support. Assign different page layouts to each record type by profile."},{"isRight":false,"describe":"Create different case field sets for IT, HR and Customer Support. Assign different field sets by profile."},{"isRight":false,"describe":"Create different case record types for IT, HR and Customer Support. Assign different page layouts to each record type by role."},{"isRight":false,"describe":"Create different case field sets for IT, HR and Customer Support. Assign different field sets by role."}]},{"describe":"Universal Containers has a requirement that an Opportunity should have a field showing the value of its associated account’s billing state. This value should not change after the Opportunity has been created. What is the recommended solution to configure this automation behavior?","answerOptions":[{"isRight":false,"describe":"FORMULA FIELD"},{"isRight":false,"describe":"WORKFLOW"},{"isRight":false,"describe":"ROLL-UP SUMMARY FIELD"},{"isRight":true,"describe":"APEX"}]},{"describe":"WHAT IS A TRUE STATEMENT IN REGARDS TO CREATING CUSTOM REPORT TYPES?","answerOptions":[{"isRight":false,"describe":"WHEN THE PRIMARY OBJECT IS A CUSTOM OBJECT AND IS DELETED, THEN THE REPORT TYPE AND ANY REPORTS CREATED FROM IT MUST BE DELETED MANUALLY."},{"isRight":false,"describe":"THE DETAIL OBJECT IN A MASTER- DETAIL RELATIONSHIP CANNOT BE ADDED AS A SECONDARY OBJECT ON A CUSTOM REPORT TYPE."},{"isRight":true,"describe":"ONCE A REPORT TYPE IS SAVED WITH A STANDARD OR CUSTOM PRIMARY OBJECT, THE PRIMARY OBJECT CANNOT BE CHANGED FOR THAT REPORT TYPE."},{"isRight":false,"describe":"ANY OBJECT CAN BE CHOSEN UNLESS THE OBJECT IS NO VISIBLE TO THE PERSON CREATING THE REPORT TYPE THROUGH SECURITY SETTINGS."}]},{"describe":"An app builder has been asked to provide users a way to identify a contact’s “preferred contact method” directly on the contact record. users need to be able to identify whether a phone number or an email, is the contact’s preferred communication method. which field type will allow the app builder to accomplish this with the fewest fields possible?","answerOptions":[{"isRight":false,"describe":"formula"},{"isRight":false,"describe":"checkboxes"},{"isRight":true,"describe":"picklist"},{"isRight":false,"describe":"email"}]},{"describe":"Universal container manages internal projects by department using a custom object called projects. only employees in the project’s respective department should have view access to all of the department’s project records. if an employee changes job roles and moves to another department, the employee should no longer have access to the projects within their former department.How can these requirements be met, assuming the organization-wide default for projects is set to private? choose 2 ans","answerOptions":[{"isRight":false,"describe":"create a criteria based sharing rule using the projects department that grants access to users by permission set."},{"isRight":true,"describe":"create a criteria based sharing rule using the projects department that grants access to users by roles."},{"isRight":true,"describe":"create a criteria based sharing rule using the projects department that grants access to users by public groups."},{"isRight":false,"describe":"create a criteria based sharing rule using the projects department that grants access to users by profiles."}]},{"describe":"In order to delete opportunities, universal containers would like sales reps to submit request for approval from their sales manager. What can be used to meet these requirements?","answerOptions":[{"isRight":false,"describe":"two step approval process"},{"isRight":false,"describe":"approval process with apex trigger"},{"isRight":false,"describe":"approval process with time depenedent workflow action"},{"isRight":true,"describe":"process builder with submit for approval action"}]},{"describe":"A custom object has a public reads only sharing settings that does not grant access using hierarchies. a dynamic sharing rule provides write access to the object to the global marketing public group if the record is marked as global. a user creates a new record and marks it as global. Who will have write access to the record?","answerOptions":[{"isRight":false,"describe":"The global marketing public group and anyone above the owner in the role hierarchy."},{"isRight":true,"describe":"The record owner and the global marketing public group."},{"isRight":false,"describe":"The global marketing public group, the record owner, and anyone above the owner in the role heirarchy."},{"isRight":false,"describe":"The record owner and anyone above the owner in the role hierarchy."}]},{"describe":"To synchronize account, orders, and shipments in real time, a developer has built a custom interface between an external and salesforce. prior to deployment, the developer needs to confirm that the interface can sustain the synching of thousands of records at a time. Which sandbox environment is recommended to complete performance and load testing?","answerOptions":[{"isRight":false,"describe":"partial sandbox"},{"isRight":true,"describe":"full sandbox"},{"isRight":false,"describe":"developer sandbox"},{"isRight":false,"describe":"developer pro sandbox"}]},{"describe":"A new custom object is being created with a private sharing setting. The business wants to share individual records with specific people or group of people on a case by case basis. what options does the business user have to manually share individual records? choose 3 ans","answerOptions":[{"isRight":true,"describe":"public groups"},{"isRight":false,"describe":"permission sets"},{"isRight":true,"describe":"roles"},{"isRight":false,"describe":"profiles"},{"isRight":true,"describe":"users"}]},{"describe":"What is true statement regarding master – detail relationship? Choose 3 ans","answerOptions":[{"isRight":true,"describe":"A master-detail relationship cannot be created if the custom object on the detail side already contains data."},{"isRight":false,"describe":"A master – detail relationship cannot be converted to a look-up relationship."},{"isRight":true,"describe":"Deleting a master record in a master detail relationship deletes all related detail records."},{"isRight":false,"describe":"Standard objects can be on the detail side of the custom object in a master-detail relationship."},{"isRight":true,"describe":"Master-detail relationship can convert to a look –up relationship if no roll-up summary field exist on the master object."}]},{"describe":"What is the capability of a schema builder? Choose 2 ans","answerOptions":[{"isRight":false,"describe":"To update description of standard and custom objects."},{"isRight":true,"describe":"To modify custom field help text on standard objects."},{"isRight":true,"describe":"To create new look-up or master-detail object relationship."},{"isRight":false,"describe":"To enable field history tracking on standard objects."}]},{"describe":"The director of marketing has asked the app builder to create a formula field that tracks how many days have elapsed since a contact was sent a marketing communication. The director is only interested in whole units. Which function should be used to calculate the difference?","answerOptions":[{"isRight":false,"describe":"Datevalue()"},{"isRight":false,"describe":"Now()"},{"isRight":false,"describe":"Date()"},{"isRight":true,"describe":"Today()"}]}],"title":"New SalesforceAppBuilder Certification – Questions set-7"}