{
  "title": "Salesforce-Certified-Platform-Developer-1-[Set-3]",
  "category": "Salesforce Dev 1",
  "questions": [
    {
      "describe": "A sales manager wants to make sure that whenever an opportunity stage is changed to \"Closed Won,\" a new case will be created for the support team to collect necessary information from the customer.\nHow should a developer accomplish this?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Create a lookup field to the Case object on the opportunity object."
        },
        {
          "isRight": false,
          "describe": "Set up a validation rule on the Opportunity.Stage."
        },
        {
          "isRight": false,
          "describe": "Create a workflow rule to create the new case."
        },
        {
          "isRight": true,
          "describe": "Create a Process Builder to create the new case."
        }
      ]
    },
    {
      "describe": "A developer wants to override a button using Visualforce on an object.\nWhat is the requirement?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "The controller or extension must have a PageReference method."
        },
        {
          "isRight": false,
          "describe": "The object record must be instantiated in a controller or extension."
        },
        {
          "isRight": true,
          "describe": "The standardController attribute must be set to the object."
        },
        {
          "isRight": false,
          "describe": "The action attribute must be set to a controller method."
        }
      ]
    },
    {
      "describe": "Which collection type provides unique key/value pairings of data?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Map"
        },
        {
          "isRight": false,
          "describe": "Array"
        },
        {
          "isRight": false,
          "describe": "List"
        },
        {
          "isRight": false,
          "describe": "Set"
        }
      ]
    },
    {
      "describe": "A method is passed a list of generic sObjects as a parameter.\nWhat should the developer do to determine which object type (Account, Lead, or Contact, for example) to cast each sObject?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Use the first three characters of the sObject ID to determine the sObject type."
        },
        {
          "isRight": true,
          "describe": "Use the getSObjectType method on each generic sObject to retrieve the sObject token."
        },
        {
          "isRight": false,
          "describe": "Use a try-catch construct to cast the sObject into one of the three sObject types."
        },
        {
          "isRight": false,
          "describe": "Use the getSObjectName method on the sObject class to get the sObject name."
        }
      ]
    },
    {
      "describe": "What are two considerations for custom Apex Exception classes?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Custom Exception class names must end with the word 'Exception'."
        },
        {
          "isRight": true,
          "describe": "Custom Exception classes must extend the base Exception class."
        },
        {
          "isRight": false,
          "describe": "Custom Exceptions cannot be extended by other Exception classes."
        },
        {
          "isRight": false,
          "describe": "Constructor for custom Exceptions can only accept string values as arguments."
        }
      ]
    },
    {
      "describe": "In which two org types can a developer create new Apex classes?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Sandbox"
        },
        {
          "isRight": true,
          "describe": "Developer Edition"
        },
        {
          "isRight": false,
          "describe": "Enterprise Edition"
        },
        {
          "isRight": false,
          "describe": "Unlimited Edition"
        }
      ]
    },
    {
      "describe": "When viewing a Quote, the sales representative wants to easily see how many discounted items are included in the Quote Line Items.\nWhat should a developer do to meet this requirement?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Create a trigger on the Quote object that queries the Quantity field on discounted Quote Line Items."
        },
        {
          "isRight": false,
          "describe": "Create a formula field on the Quote object that performs a SUM on the Quote Line Item Quantity field, filtered for only discounted Quote Line Items."
        },
        {
          "isRight": false,
          "describe": "Create a Workflow Rule on the Quote Line Item object that updates a field on the parent Quote when the item is discounted."
        },
        {
          "isRight": true,
          "describe": "Create a roll-up summary field on the Quote object that performs a SUM on the Quote Line Item Quantity field, filtered for only discounted Quote Line Items."
        }
      ]
    },
    {
      "describe": "When are code coverage calculations updated?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "When unit tests are run on an organization."
        },
        {
          "isRight": false,
          "describe": "When Apex code is saved."
        },
        {
          "isRight": false,
          "describe": "When a deployment is validated."
        },
        {
          "isRight": false,
          "describe": "When changes are made to an organization's configuration."
        }
      ]
    },
    {
      "describe": "A developer is creating test coverage for a class and needs to insert records to validate functionality.\nWhich method annotation should be used to create records for every method in the test class?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "@isTest(SeeAllData=true)"
        },
        {
          "isRight": false,
          "describe": "@BeforeTest"
        },
        {
          "isRight": false,
          "describe": "@PreTest"
        },
        {
          "isRight": true,
          "describe": "@TestSetup"
        }
      ]
    },
    {
      "describe": "Which two are true regarding Apache Kafka on Heroku?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Is a messaging backbone for building distributed applications?"
        },
        {
          "isRight": true,
          "describe": "Is a distributed commit log for communication between services"
        },
        {
          "isRight": false,
          "describe": "Is designed to move small volumes of ephemeral data"
        },
        {
          "isRight": false,
          "describe": "Is an add-on that creates a long term data store"
        }
      ]
    },
    {
      "describe": "Universal Containers requires Service Representatives to update all Cases at least once every three days. To make sure this policy is obeyed, a developer has been asked to implement a field that displays the number of days since the last Case update.\nWhat should the developer use to configure the solution?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Process Builder"
        },
        {
          "isRight": false,
          "describe": "Workflow rule"
        },
        {
          "isRight": true,
          "describe": "Formula field"
        },
        {
          "isRight": false,
          "describe": "Scheduled Apex Class"
        }
      ]
    },
    {
      "describe": "A developer executes the following query in Apex to retrieve a list of contacts for each account:\nList<Account> accounts = [Select ID, Name, (Select ID, Name from Contacts) from Account];\nWhich two exceptions may occur when it executes?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "SOQL query limit exception due to the number of queries"
        },
        {
          "isRight": true,
          "describe": "SOQL query row limit exception due to the number of accounts"
        },
        {
          "isRight": true,
          "describe": "SOQL query row limit exception due to the number of contacts"
        },
        {
          "isRight": false,
          "describe": "CPU limit exception due to the complexity of the query"
        }
      ]
    },
    {
      "describe": "A lead record that has a single related CampaignMember object is converted into a new account, contact, and opportunity.\nWhich object will the CampaignMember reference using a lookup field after conversion?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "The Product2"
        },
        {
          "isRight": false,
          "describe": "The Opportunity"
        },
        {
          "isRight": true,
          "describe": "The Contact"
        },
        {
          "isRight": false,
          "describe": "The Account"
        }
      ]
    },
    {
      "describe": "Which two describe Heroku Redis?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Is an in-memory key-value data store, run by Heroku."
        },
        {
          "isRight": false,
          "describe": "Is a repository for storing large images"
        },
        {
          "isRight": false,
          "describe": "Is an option for long term data storage"
        },
        {
          "isRight": true,
          "describe": "Is provisioned and managed as an add-on."
        }
      ]
    },
    {
      "describe": "What are two considerations for deciding to use a roll-up summary field?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Roll-up summary can be performed on formula fields, but if their formula contains an #Error result, it may affect the summary value."
        },
        {
          "isRight": true,
          "describe": "Roll-up summary fields do not cause validation rules on the parent object unless that object is edited separately."
        },
        {
          "isRight": false,
          "describe": "Roll-up cannot be performed on formula fields that use cross-object references or on-the-fly calculations such as NOW()."
        },
        {
          "isRight": false,
          "describe": "Roll-up cannot be performed on formula fields."
        }
      ]
    }
  ]
}