{
  "title": "Salesforce-Admin-201-[Set-9]",
  "category": "Salesforce Admin 201",
  "questions": [
    {
      "describe": "Which option is available when using process Visualizer?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Share annotated approval process diagrams"
        },
        {
          "isRight": false,
          "describe": "Add approval steps from the process Visualizer."
        },
        {
          "isRight": false,
          "describe": "Edit the criteria used to trigger the approval process."
        },
        {
          "isRight": true,
          "describe": "View approval process as a flow chart."
        }
      ]
    },
    {
      "describe": "[#27] Universal containers has a marketing team set up as a public group. A sales representative would like to engage the marketing team on one opportunity.\nWhat should the sales representative do to ensure the marketing team can access the opportunity?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "manually share the record with the public group"
        },
        {
          "isRight": false,
          "describe": "add the public group to the opportunity team"
        },
        {
          "isRight": false,
          "describe": "change the opportunity owner to the public group"
        }
      ]
    },
    {
      "describe": "What can be modified on standard object fields?\n*Choose 3 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Help text"
        },
        {
          "isRight": false,
          "describe": "Default text"
        },
        {
          "isRight": true,
          "describe": "Label"
        },
        {
          "isRight": false,
          "describe": "Field type"
        },
        {
          "isRight": true,
          "describe": "Picklist values"
        }
      ]
    },
    {
      "describe": "What is the purpose of the AppExchange?\n*Choose 2 answers*",
      "answerOptions": [
        null,
        {
          "isRight": true,
          "describe": "Customers can share and install apps published by Salesforce partners."
        },
        {
          "isRight": true,
          "describe": "Administrators can downloaded and customize pre-built reports and dashboards."
        },
        {
          "isRight": false,
          "describe": "Partners can download accounts and contacts to collaborate on sales deals."
        }
      ]
    },
    {
      "describe": "What is the purpose of the Service Cloud(customer) portal?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "To allow partners to access contact records for case collaboration"
        },
        {
          "isRight": true,
          "describe": "To provide Web self-service by exposing Knowledge articles"
        },
        {
          "isRight": true,
          "describe": "To allow customers to log and check the status of cases online."
        },
        {
          "isRight": false,
          "describe": "To share support reports and dashboards with high-profile accounts."
        }
      ]
    },
    {
      "describe": "Criteria-based sharing rules can be created for which objects?\n*Choose 3 answers*",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Users"
        },
        {
          "isRight": true,
          "describe": "Contacts"
        },
        {
          "isRight": true,
          "describe": "Accounts"
        },
        {
          "isRight": false,
          "describe": "Campaign Members"
        },
        {
          "isRight": true,
          "describe": "Opportunities"
        }
      ]
    },
    {
      "describe": "If two objects have a parent-child relationship, how can a user access the child record from the parent record.",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Child field"
        },
        {
          "isRight": true,
          "describe": "Related list"
        },
        {
          "isRight": false,
          "describe": "Lookup field"
        },
        {
          "isRight": false,
          "describe": "Custom link"
        }
      ]
    },
    {
      "describe": "A system administrator at Universal Containers created a new account record type. However, sales users are unable to select the new record type when creating new account records.\nWhat is possible reason for it?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "The record type has not been activated."
        },
        {
          "isRight": false,
          "describe": "The record type does not have an associated page layout."
        },
        {
          "isRight": false,
          "describe": "The record type has not been set as the default record type."
        },
        {
          "isRight": true,
          "describe": "The record type has not been added to the sales users profile."
        }
      ]
    },
    {
      "describe": "How can a system administrator restrict users from viewing certain fields in list view, searches, page layouts and reports?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Remove the field rom reports and list views."
        },
        {
          "isRight": false,
          "describe": "Set the field to hidden on user role."
        },
        {
          "isRight": false,
          "describe": "Remove the field from page layouts"
        },
        {
          "isRight": true,
          "describe": "Set field to hidden using field-level security."
        }
      ]
    },
    {
      "describe": "What should an administrator consider when configuring workflow rules?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Rules must be deactivated before using an import wizard."
        },
        {
          "isRight": true,
          "describe": "Rule actions can take place immediately or on a specific date."
        },
        {
          "isRight": false,
          "describe": "All existing records are evaluated when a new rule is activated."
        },
        {
          "isRight": true,
          "describe": "Rules can be evaluated when records are created or edited."
        }
      ]
    },
    {
      "describe": "When importing data, what happens if some records do NOT meet the data validation criteria?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Import process requires user authorization to import the invalid records"
        },
        {
          "isRight": true,
          "describe": "Import process fails only for the records with invalid data"
        },
        {
          "isRight": false,
          "describe": "Import process aborts when it encounters the first invalid record"
        },
        {
          "isRight": false,
          "describe": "Import process ignores the data validation criteria"
        }
      ]
    },
    {
      "describe": "How can a system administrator add users to a salesforce organization using Chatter Free?\nChoose 2 answers",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Create users in the organization and assign them a Chatter Free license"
        },
        {
          "isRight": false,
          "describe": "Assign Chatter Free licenses to users outside the specified email domains."
        },
        {
          "isRight": false,
          "describe": "Assign Chatter Free licenses to excisting Salesforce users."
        },
        {
          "isRight": true,
          "describe": "Enable invites to allow users to invite others within specific email domains."
        }
      ]
    },
    {
      "describe": "What is an option when customuzing a report?\n*Choose 3 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Adding a group"
        },
        {
          "isRight": true,
          "describe": "Add a filter"
        },
        {
          "isRight": false,
          "describe": "Add a gauge component"
        },
        {
          "isRight": false,
          "describe": "Schedule a refresh time"
        },
        {
          "isRight": true,
          "describe": "Summarise fields"
        }
      ]
    },
    {
      "describe": "Which statement about Chatter posts and comments is true?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Updates to the Chatter feed on a record are only visible to users with access to the records."
        },
        {
          "isRight": false,
          "describe": "Posts to a user's profile are hidden from anyone below that user in the role hierarhy."
        },
        {
          "isRight": true,
          "describe": "Posts made to a user's profile are visible to all users in the organisation."
        },
        {
          "isRight": false,
          "describe": "Posts to a user's profile can be made private by clicking the lock icon."
        }
      ]
    },
    {
      "describe": "When using sharing rules, what users can records be shared with?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Public groups"
        },
        {
          "isRight": true,
          "describe": "Roles and subordinates"
        },
        {
          "isRight": false,
          "describe": "Profiles"
        },
        {
          "isRight": false,
          "describe": "Queues"
        }
      ]
    },
    {
      "describe": "Universal Containers wants to ensure that users complete the standard industry field when creating a new account record. To address this concern, the administrator set the Industry field as required. However, some users are still able to create a new account record without completing the industry field.\nWhat should an administrator do to troubleshoot the issue?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Verify the industry field is set as required on all the account page layouts assigned to the user's profiles."
        },
        {
          "isRight": false,
          "describe": "Verify the users have the \"Modify All Data\" permission for accounts on their profiles."
        },
        {
          "isRight": false,
          "describe": "Verify the users have the \"Edit\" permission for accounts on their profiles."
        },
        {
          "isRight": true,
          "describe": "Verify the field-level security for the industry field is not set to \"Read only\" on the user's profile."
        }
      ]
    },
    {
      "describe": "Sales representatives at Universal Containers should not be able to create leads, delete their own accounts, or send mass emails.\nHow can an administrator meet these requirements?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Create a sharing rule."
        },
        {
          "isRight": true,
          "describe": "Create a custom profile"
        },
        {
          "isRight": false,
          "describe": "Modify a custom profile."
        },
        {
          "isRight": false,
          "describe": "Change the organisation-wide default settings."
        }
      ]
    },
    {
      "describe": "How can a system administrator grant users access to dashboards?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Create and share data categories"
        },
        {
          "isRight": true,
          "describe": "Share folders with public groups"
        },
        {
          "isRight": false,
          "describe": "Designate running users"
        },
        {
          "isRight": true,
          "describe": "Share folders with roles"
        }
      ]
    },
    {
      "describe": "What does a custom report type determine?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "The objects that are available when building a report"
        },
        {
          "isRight": false,
          "describe": "The report format of the resulting report"
        },
        {
          "isRight": true,
          "describe": "The fields that can be used as columns when building a report"
        },
        {
          "isRight": false,
          "describe": "The custom summary formulas displayed in a resulting report"
        }
      ]
    },
    {
      "describe": "The sales team at Universal Containers wants an easy solution to gather customer requirements and share presentations with their customers.\nWhat should an administrator do to help the sales team achieve this goal?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Add customers to private Chatter groups."
        },
        {
          "isRight": false,
          "describe": "Create opportunity teams for customers."
        },
        {
          "isRight": false,
          "describe": "Add customers to libraries."
        },
        {
          "isRight": true,
          "describe": "Use Chatter files to share presentations."
        }
      ]
    },
    {
      "describe": "How an a sales user relate an opportunity to a campaign?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Select the campaign record type when creating the opportunity."
        },
        {
          "isRight": true,
          "describe": "Select the primary campaign source for the opportunity."
        },
        {
          "isRight": true,
          "describe": "Use the campaign influence related list on the opportunity."
        },
        {
          "isRight": false,
          "describe": "Use the campaign hierarchy related list on the opportunity."
        }
      ]
    },
    {
      "describe": "Universal Containers requires that the organization-wide default for opportunities be set to public read/write. However, sales users are complaining that reports return too many results, making it difficult to find their team's opportunities in the report results.\nHow can the system administrator address this problem?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Update the sharing rules to limit user access to certain opportunities."
        },
        {
          "isRight": false,
          "describe": "Move the opportunity reports into each user's personal report folder."
        },
        {
          "isRight": false,
          "describe": "Move the opportunity reports into a folder with restricted access."
        },
        {
          "isRight": true,
          "describe": "Use the Show filter to filter report results and reduce records returned."
        }
      ]
    },
    {
      "describe": "The marketing team at Universal Containers uses a web-to-lead form to capture leads from its website and a lead assignment rule to assign the leads to the appropriate sales representatives.\nHow can a system administrator ensure that all leads are handled even when they do not meet the assignment criteria?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Specify a default lead owner."
        },
        {
          "isRight": false,
          "describe": "Specify a default lead creator."
        },
        {
          "isRight": false,
          "describe": "Create an escalation rule to route unassigned leads."
        },
        {
          "isRight": false,
          "describe": "Create a validation rule to route unassigned leads."
        }
      ]
    },
    {
      "describe": "What does the controlling field determine when field dependencies are being created?",
      "answerOptions": []
    },
    {
      "describe": "What will happen when a user attempts to log in to salesforce from an IP address that is outside the login IP range on the User's profile within the organization-wide trusted IP range?",
      "answerOptions": []
    },
    {
      "describe": "What can be transferred from one user to another user during mass transfer of account records?\n*Choose 3 answers*",
      "answerOptions": []
    },
    {
      "describe": "A sales executive at Universal containers wants to be notified whenever high-value opportunities are created for hot accounts.\nHow should an administrator meet this requirement?",
      "answerOptions": []
    },
    {
      "describe": "Universal Containers needs to use cases to manage both customer support issue and internal change requests.\nWhich functionality should a system admin use to meet this requirement?\n*Choose 3 answers*",
      "answerOptions": []
    },
    {
      "describe": "An opportunity record created with a close date of July 30, meets the criteria of time -dependent workflow rule. The time dependent action is scheduled for July 23.\nWhat happens if the opportunity is edited before July 23 and no longer meets the criteria?",
      "answerOptions": []
    },
    {
      "describe": "When case assignment rules are being set up, cases can be assigned to whom?\n*Choose 2 answers*",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Queue"
        },
        {
          "isRight": false,
          "describe": "Case team"
        },
        {
          "isRight": true,
          "describe": "User"
        },
        {
          "isRight": false,
          "describe": "Contact"
        }
      ]
    }
  ]
}