{
  "title": "Salesforce-Admin-201-[Set-3]",
  "category": "Salesforce Admin 201",
  "questions": [
    {
      "describe": "When should a system administrator consider using the Salesforce AppExchange? (Choose 2)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "To submit ideas for Salesforce application enhancements"
        },
        {
          "isRight": false,
          "describe": "To find answers to Salesforce application questions"
        },
        {
          "isRight": true,
          "describe": "When looking for pre-built custom applications and tools"
        },
        {
          "isRight": true,
          "describe": "When standard Salesforce functionality needs to be extended"
        }
      ]
    },
    {
      "describe": "A marketing user has received a file of leads to import into Salesforce. What is the best way to avoid duplicating records?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Merge Leads Function"
        },
        {
          "isRight": false,
          "describe": "Validation rules"
        },
        {
          "isRight": true,
          "describe": "Import Wizard"
        },
        {
          "isRight": false,
          "describe": "Data Loader"
        }
      ]
    },
    {
      "describe": "A user profile has login hour restrictions set to Monday through Friday 8am to 5pm. The user logged in at 4:30 pm on a Tuesday and it is now 5:01 pm. Which behavior of the application should the user expect?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "The user will be able to continue working and start new sessions"
        },
        {
          "isRight": true,
          "describe": "The user will be logged out and any unsaved work in progress will be lost"
        },
        {
          "isRight": false,
          "describe": "The user will be logged out and any unsaved work in progress will be saved"
        },
        {
          "isRight": false,
          "describe": "The user will be able to continue working, but will be unable to start any new sessions"
        }
      ]
    },
    {
      "describe": "Sales management at Universal Containers is requesting better visibility into specific types of sales deals. They need to be notified when opportunities worth a large amount are close to closing. They would also like to receive a list of opportunities that are still open past the close date. Which feature can a system administrator use to accomplish this? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Big deal alerts"
        },
        {
          "isRight": false,
          "describe": "Opportunity Escalation Rules"
        },
        {
          "isRight": true,
          "describe": "Opportunity update reminders"
        },
        {
          "isRight": false,
          "describe": "Opportunity field history tracking"
        }
      ]
    },
    {
      "describe": "When can a validation rule be used to prevent invalid data?(Choose 3)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "When records are deleted by a user"
        },
        {
          "isRight": true,
          "describe": "When records are edited by a user"
        },
        {
          "isRight": true,
          "describe": "When records are submitted using web-to-lead"
        },
        {
          "isRight": false,
          "describe": "When records are updated by a workflow rule"
        },
        {
          "isRight": true,
          "describe": "When records are imported"
        }
      ]
    },
    {
      "describe": "What should a system administrator consider when setting up Mobile Lite? (Choose 2)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Mobile Lite users must have a mobile license assigned to them"
        },
        {
          "isRight": true,
          "describe": "Mobile Lite provides access to standard objects and dashboards"
        },
        {
          "isRight": false,
          "describe": "Mobile Lite configurations can be created for each user"
        },
        {
          "isRight": true,
          "describe": "Mobile Lite must be enabled before users can install it"
        }
      ]
    },
    {
      "describe": "Which type of chart can be used to display summary values from two different levels of grouping in a report?(Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Stacked bar chart"
        },
        {
          "isRight": false,
          "describe": "Funnel chart"
        },
        {
          "isRight": false,
          "describe": "Donut chart"
        },
        {
          "isRight": true,
          "describe": "Grouped line chart"
        }
      ]
    },
    {
      "describe": "Which accounts are automatically synchronized on Salesforce Classic Lite?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "All recently accessed accounts"
        },
        {
          "isRight": false,
          "describe": "Accounts selected with the sync button"
        },
        {
          "isRight": false,
          "describe": "Accounts that the user owns"
        },
        {
          "isRight": false,
          "describe": "Any account created in the last 30 days"
        }
      ]
    },
    {
      "describe": "Which permission is required to install and uninstall packages from Salesforce AppExchange?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Create AppExchange Packages"
        },
        {
          "isRight": false,
          "describe": "Manage Package Licenses"
        },
        {
          "isRight": false,
          "describe": "Upload AppExchange Packages"
        },
        {
          "isRight": true,
          "describe": "Download AppExchange Packages"
        }
      ]
    },
    {
      "describe": "What user interface setting must be enabled for users to edit records in a list view?(Choose 2)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Enhanced page layout editor"
        },
        {
          "isRight": true,
          "describe": "Enhanced lists"
        },
        {
          "isRight": false,
          "describe": "Enhanced profile list views"
        },
        {
          "isRight": true,
          "describe": "Inline editing"
        }
      ]
    },
    {
      "describe": "Which task can a delegated administrator perform? (Choose 3)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Log in as a user who has granted login access"
        },
        {
          "isRight": false,
          "describe": "Reset passwords for all users"
        },
        {
          "isRight": false,
          "describe": "Create new user profiles"
        },
        {
          "isRight": true,
          "describe": "Manage users within specified roles"
        },
        null,
        {
          "isRight": true,
          "describe": "Manage specified custom objects"
        }
      ]
    },
    {
      "describe": "Which schedule type can be defined for a product? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Quantity"
        },
        {
          "isRight": false,
          "describe": "Forecast"
        },
        {
          "isRight": true,
          "describe": "Revenue"
        },
        {
          "isRight": false,
          "describe": "Production"
        }
      ]
    },
    {
      "describe": "How can a sales user relate an opportunity to a campaign? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Use the campaign influences related list on the opportunity"
        },
        {
          "isRight": true,
          "describe": "Select the primary campaign source for the opportunity"
        },
        {
          "isRight": false,
          "describe": "Select the campaign record type when creating the opportunity"
        },
        {
          "isRight": false,
          "describe": "Use the campaign hierarchy related list on the opportunity"
        }
      ]
    },
    {
      "describe": "Universal Containers set the Organization-Wide Defaults for accounts to public read/write. The sales management team is importing a new set of account records and needs to limit access to them. Access should be restricted to the account owner and members of a public group. How can this be accomplished?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Update the organization - wide defaults for accounts to private and create a sharing rule for the group."
        },
        {
          "isRight": false,
          "describe": "Create a sharing rule to grant access to members of the public group."
        },
        {
          "isRight": false,
          "describe": "Manually share each account record with members of the public group."
        },
        {
          "isRight": false,
          "describe": "Upgrade the role hierarchy and assign members of the group to a role at the top of the hierarchy."
        }
      ]
    },
    {
      "describe": "Universal Containers is capturing a percentage discount directly on an opportunity record. Sales management needs to include the discounted opportunity amount in pipeline reports. How can the system administrator make the discounted amount available?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Create an auto-number field to calculate the discounted amount."
        },
        {
          "isRight": true,
          "describe": "Create a formula field to calculate the discounted amount."
        },
        {
          "isRight": false,
          "describe": "Create a roll-up summary field to calculate the discounted amount."
        },
        {
          "isRight": false,
          "describe": "Create a cross object formula field to calculate the discounted amount."
        }
      ]
    },
    {
      "describe": "Which setting can a system administrator control in the Salesforce user interface? (Choose 3)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Enable hover details"
        },
        {
          "isRight": true,
          "describe": "Enable spell checker"
        },
        {
          "isRight": true,
          "describe": "Enable enhanced list views"
        },
        {
          "isRight": false,
          "describe": "Enable Chatter for specific users"
        },
        {
          "isRight": false,
          "describe": "Enable customizable recent items"
        }
      ]
    },
    {
      "describe": "Universal Containers has set the organization-wide default settings for accounts to private. Amy and bob are on separate sales teams, but are assigned tot he same role in the hierarchy. Amy is a member of the \"Sales West\" public group and needs access to all accounts owned by Bob, a member of the \"Sales East\" group. How would an administrator grant Amy access to only Bob's accounts?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Add Amy to the \"Sales East\" public group"
        },
        {
          "isRight": true,
          "describe": "Add Amy to Bob's default account team"
        },
        {
          "isRight": false,
          "describe": "Create a sharing rule between the \"Sales West\" and \"Sales East\" public groups"
        },
        {
          "isRight": false,
          "describe": "Add Amy to the role above Bob in the role hierarchy"
        }
      ]
    },
    {
      "describe": "Which record type can be updated when converting a lead? (Choose 2)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "An existing custom object record"
        },
        {
          "isRight": true,
          "describe": "An existing opportunity record"
        },
        {
          "isRight": false,
          "describe": "An existing contact record"
        },
        {
          "isRight": true,
          "describe": "An existing account record"
        }
      ]
    },
    {
      "describe": "Which functionality is available when customizing tasks? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Record types can be created for tasks"
        },
        {
          "isRight": true,
          "describe": "Validation rules can be created for tasks"
        },
        {
          "isRight": false,
          "describe": "Roll-up summary fields can be created for tasks"
        },
        {
          "isRight": false,
          "describe": "Recurring tasks can be assigned to more than one user"
        }
      ]
    },
    {
      "describe": "What can an administrator assign to both Ideas and Answers?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Status"
        },
        {
          "isRight": false,
          "describe": "Sharing Rules"
        },
        {
          "isRight": true,
          "describe": "Categories"
        },
        {
          "isRight": false,
          "describe": "Workflow Rules"
        }
      ]
    },
    {
      "describe": "Which statement about formula fields is true? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Formula fields are read-only on record detail pages"
        },
        {
          "isRight": false,
          "describe": "Formula fields can reference fields on a child object"
        },
        {
          "isRight": false,
          "describe": "Formula fields can reference themselves in the formula"
        },
        {
          "isRight": true,
          "describe": "Formula fields can reference fields on a parent object"
        }
      ]
    },
    {
      "describe": "Which statement about public groups is true? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Public groups can be used in sharing rules"
        },
        {
          "isRight": false,
          "describe": "Public groups allows users to delete personal accounts"
        },
        {
          "isRight": true,
          "describe": "Public groups can be used when manually sharing a record"
        },
        {
          "isRight": false,
          "describe": "Public groups can be created by any user"
        }
      ]
    },
    {
      "describe": "Universal Technology sells software and consulting services. The software sales team uses a different set of sales stages than the consulting services team. How can a system administrator set up the process? (Choose 2)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Use a validation rule to prevent the software from access the services team's sales process"
        },
        {
          "isRight": true,
          "describe": "Create a record type for each sales process and assign it to the appropriate profiles"
        },
        {
          "isRight": false,
          "describe": "Create a separate lead process for the software sales team and service sales team"
        },
        {
          "isRight": true,
          "describe": "Create a unique list of opportunity stage picklist values for each sales process"
        }
      ]
    },
    {
      "describe": "A system administrator at Universal containers incorrectly imported a set of records and needs to remove them from Salesforce. Which tool should the administrator use to complete the task? (Choose 2)",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Import Wizard"
        },
        {
          "isRight": true,
          "describe": "Mass Delete"
        },
        {
          "isRight": false,
          "describe": "Excel Connector"
        },
        {
          "isRight": true,
          "describe": "Data Loader"
        }
      ]
    },
    {
      "describe": "What determines whether a user can create a new record using a specific record type?",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "Profile"
        },
        {
          "isRight": false,
          "describe": ". Sharing"
        },
        {
          "isRight": false,
          "describe": "Page layout"
        },
        {
          "isRight": false,
          "describe": "Field level security"
        }
      ]
    },
    {
      "describe": "Universal Finance has segmented its customer base into two categories: High Wealth and Retirement. High Wealth accounts should be visible to High Wealth Sales team members only. Retirement accounts should be visible to all sales users. How can a system administrator meet this requirement?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Set the organization-wide default sharing to public read-only and create a sharing rule to limit access to High Wealth accounts"
        },
        {
          "isRight": false,
          "describe": "Create a new profile for Retirement Sales team members and remove read access to High Wealth account records."
        },
        {
          "isRight": true,
          "describe": "Set the organization-wide default sharing to private and create a sharing rule to share Retirement accounts with all Sales users"
        },
        {
          "isRight": false,
          "describe": "Create a new record type for high Wealth accounts and share the record type with High Wealth sales team members"
        }
      ]
    },
    {
      "describe": "Which statement about Mobile Lite is true? (Choose 2)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "It must be enabled by an administrator"
        },
        {
          "isRight": false,
          "describe": "It is available to customer portal users"
        },
        {
          "isRight": true,
          "describe": "It is available to users without a mobile license"
        },
        {
          "isRight": false,
          "describe": "It is available to partner portal users"
        }
      ]
    },
    {
      "describe": "A marketing user has received a file of leads to import into Salesforce. What is the best way to avoid duplicating records?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Merge Leads Function"
        },
        {
          "isRight": true,
          "describe": "Import Wizard"
        },
        {
          "isRight": false,
          "describe": "Validation rules"
        },
        {
          "isRight": false,
          "describe": "Data Loader"
        }
      ]
    },
    {
      "describe": "A marketing manager needs to view summary metrics across a set of related campaigns. How can this be accomplished?",
      "answerOptions": [
        {
          "isRight": false,
          "describe": "Establish the campaign influence between related campaigns"
        },
        {
          "isRight": false,
          "describe": "Build a lead source report to summarize the campaign metrics"
        },
        {
          "isRight": false,
          "describe": "Create a cross object formula field to calculate summary metrics"
        },
        {
          "isRight": true,
          "describe": "Create a campaign hierarchy and include the related campaigns"
        }
      ]
    },
    {
      "describe": "What does the report type determine when a new report is created? (Choose 3)",
      "answerOptions": [
        {
          "isRight": true,
          "describe": "The default columns in the report"
        },
        {
          "isRight": true,
          "describe": "The fields available to include in the report\nC Whether the report will be tabular, summary, or matrix"
        },
        null,
        {
          "isRight": true,
          "describe": "The object included in the report"
        },
        {
          "isRight": false,
          "describe": "Whether the report can be displayed in a dashboard"
        }
      ]
    }
  ]
}